app/controllers/greetings_controller.rb

SELECT COUNT(*) FROM `greetings`
SELECT `greetings`.* FROM `greetings`
---
    def index
        @greetings = Greeting.all.page(params[:page]).per(9)

INSERT INTO `greetings` (`message`, `author`, `created_at`, `updated_at`) VALUES (' fvd v dfv fv dv', 'wr4f', '2024-01-16 09:53:55.942664', '2024-01-16 09:53:55.942664')
---
    def create
        @greeting = Greeting.new(greeting_params)
        if @greeting.save

SELECT `greetings`.* FROM `greetings` WHERE `greetings`.`id` = 2 LIMIT 1
---
      def show
        @greeting = Greeting.find(params[:id])

SELECT `greetings`.* FROM `greetings` WHERE `greetings`.`id` = 4 LIMIT 1
DELETE FROM `greetings` WHERE `greetings`.`id` = 4
---
    def destroy
        @greeting = Greeting.find(params[:id])
        @greeting.destroy