app/controllers/home_controller.rb

SELECT `greetings`.* FROM `greetings`
SELECT `pictures`.* FROM `pictures`
---
  def index
    @greetings = Greeting.all
    @pictures = Picture.all