app/controllers/pictures_controller.rb

    def index
        @pictures = Picture.all.page(params[:page]).per(9)
---
SELECT COUNT(*) FROM `pictures`
SELECT `pictures`.* FROM `pictures`

    def create
      @picture = Picture.new(picture_params)

      if @picture.save
---
INSERT INTO `pictures` (`image`, `author`, `caption`, `created_at`, `updated_at`) VALUES ('484181.0.jpg', 'dca', 'casd', '2024-01-21 12:12:07.641967', '2024-01-21 12:12:07.641967')

      def show
        @picture = Picture.find(params[:id])
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1